/*

A.01 기초 정보 관리
	- 과정명, 과목명, 강의실명(정원 포함), 교재명(출판사명 포함) 입력, 출력, 수정, 삭제

A.02 교사 계정 관리
	- 전체 명단의 교사명, 주민번호 뒷자리, 전화번호, 강의 가능 과목을 출력
	- 특정 교사의 배정된 개설 과목명, 개설 과목 기간(시작 년 월일, 끝 년월일), 교재명, 강의실, 강의진행여부(날짜별 기준) 조회
	- 교사 정보 입력, 출력, 수정, 삭제
	- 교사의 강의가능과목 추가(과목명으로 입력)
    
A.03 개설 과정 관리
	- 과정명, 과정 기간(시작 년월일, 끝 년월일), 강의실 정보를 입력
	- 개설 과정 정보 입력, 출력, 수정, 삭제
	- 개설 과정 정보 출력 시 개설 과정명, 개설 과정기간(시작 년월일, 끝 년월일), 강의실명, 개설 과목 등록 여부, 교육생 등록인원을 출력
	- 특정 개설 과정 선택 시 개설 과정에는 등록된 개설 과목 정보(과목명, 과목기간(시작 년월일, 끝년월일), 교재명, 교사명) 및 등록된 교육생 정보(교육생 이름, 주민번호 뒷자리, 등록일, 수료 및 중도 탈락) 조회
	- 특정 개설 과정이 수료한 경우 등록된 교육생 전체에 대해서 수료날짜를 지정(중도탈락자 제외)
	- 강의실 정보 추가(강의실명으로 입력)
    
A.04 개설 과목 관리
	- 특정 개설 과정 선택 시 개설 과목 정보 출력 및 개설 과목 신규 등록
	- 개설 과목 정보 입력시 과목명, 과목기간(시작 년월일, 끝 년월일), 교재명, 교사명을 입력
	- 개설 과목 출력 시 개설 과정 정보(과정명, 과정기간(시작 년월일, 끝 년월일), 강의실)와 과목명, 과목기간(시작 년월일, 끝 년월일), 교재명, 교사명을 출력
	- 개설 과목 정보에 대한 입력, 출력, 수정, 삭제

*/

-- 기초 정보 관리



-- 교사 계정 관리


-- 개설 과정 관리


-- 개설 과목 관리
